//
//  PlayerNameUtil.m
//  XPlan
//
//  Created by Hex on 3/31/13.
//  Copyright (c) 2013 Hex. All rights reserved.
//

#import "PlayerNameUtil.h"

static PlayerNameUtil *_nameUtilInstance = nil;

@implementation PlayerNameUtil

+(PlayerNameUtil*) sharedNameUtil
{
    @synchronized([PlayerNameUtil class])
    {
        if (!_nameUtilInstance)
        {
            _nameUtilInstance = [[self alloc] init];
        }
    }
    
    return _nameUtilInstance;
}

+(id) alloc
{
    @synchronized([PlayerNameUtil class])
    {
        KITAssert(_nameUtilInstance == nil, @"There can only be one PlayerNameUtil singleton");
        return [super alloc];
    }
    return nil;
}

-(id) init
{
    if ((self = [super init]))
    {
        surnameList = [[NSArray alloc] initWithObjects:@"司马", @"欧阳", @"端木", @"上官", @"独孤", @"夏侯", @"尉迟", @"赫连", @"皇甫", @"公孙", @"慕容", @"长孙", @"宇文", @"司徒", @"轩辕", @"百里", @"呼延", @"令狐", @"诸葛", @"南宫", @"东方", @"西门", @"李", @"王", @"张", @"刘", @"陈", @"杨", @"赵", @"黄", @"周", @"胡", @"林", @"梁", @"宋", @"郑", @"唐", @"冯", @"董", @"程", @"曹", @"袁", @"许", @"沈", @"曾", @"彭", @"吕", @"蒋", @"蔡", @"魏", @"叶", @"杜", @"夏", @"汪", @"田", @"方", @"石", @"熊", @"白", @"秦", @"江", @"孟", @"龙", @"万", @"段", @"雷", @"武", @"乔", @"洪", @"鲁", @"葛", @"柳", @"岳", @"梅", @"辛", @"耿", @"关", @"苗", @"童", @"项", @"裴", @"鲍", @"霍", @"甘", @"景", @"包", @"柯", @"阮", @"华", @"滕", @"穆", @"燕", @"敖", @"冷", @"卓", @"花", @"蓝", @"楚", @"荆", @"汤", @"肖", @"萧", @"温", @"邓", @"谈", @"范",@"钟",@"苏",@"韩",@"于",@"谢",@"展",@"余",@"徐",@"彭",@"奚",@"古",@"朱",@"简",@"孔",@"罗",@"贝",@"艾",@"严",@"任",@"窦",@"邱",@"韦",@"昊",@"贾",@"聂",@"纡徐",@"莫洛",@"六小",@"潇湘", nil];
        man0 = [[NSArray alloc] initWithObjects:@"峰", @"不", @"近", @"小", @"千", @"万", @"百", @"一", @"求", @"笑", @"双", @"凌", @"伯", @"仲", @"叔", @"震", @"飞", @"晓", @"昌", @"霸", @"冲", @"志", @"留", @"九", @"子", @"立", @"小", @"云", @"文", @"安", @"博", @"才", @"光", @"弘", @"华", @"清", @"灿", @"俊", @"凯", @"乐", @"良", @"明", @"健", @"辉", @"天", @"星", @"永", @"玉", @"英", @"真", @"修", @"义", @"雪", @"嘉", @"成", @"傲", @"欣", @"逸", @"飘", @"凌", @"青", @"火", @"森", @"杰", @"思", @"智", @"辰", @"元", @"夕", @"苍", @"劲", @"巨", @"潇", @"紫", @"邪", @"尘",@"亦",@"钊",@"桦",@"瑞",@"育",@"奥",@"乔",@"锦",@"淼",@"治",@"耀",@"品",@"博",@"铭",@"律",@"填",@"松",@"洁",@"朝",@"海",@"茗",@"皓",@"炜",@"瀚",@"经",@"承",@"尔", nil];
        man1 = [[NSArray alloc] initWithObjects:@"败", @"悔", @"南", @"宝", @"仞", @"刀", @"斐", @"德", @"云", @"天", @"仁", @"岳", @"宵", @"忌", @"爵", @"权", @"敏", @"阳", @"狂", @"冠", @"康", @"平", @"过", @"刚", @"强", @"凡", @"邦", @"福", @"歌", @"国", @"和", @"康", @"澜", @"民", @"宁", @"然", @"顺", @"翔", @"晏", @"宜", @"怡", @"易", @"志", @"雄", @"佑", @"斌", @"河", @"元", @"墨", @"松", @"林", @"之", @"翔", @"竹", @"宇", @"轩", @"荣", @"哲", @"风", @"霜", @"山", @"炎", @"罡", @"盛", @"睿", @"达", @"洪", @"武", @"耀", @"磊", @"寒", @"冰", @"潇", @"痕", @"岚", @"空", @"野", @"演", @"欲", @"鑫", @"豪", @"纶", @"智", @"相", @"标", @"颖", @"发", @"城", @"摩", @"逸", @"烷", @"廷", @"允", @"恒", @"赫", @"歆", @"卿", @"裘", @"殷", @"浒", @"瑛", @"程", @"坤", nil];
        woman0 = [[NSArray alloc] initWithObjects:@"思", @"冰", @"夜", @"子", @"依", @"小", @"香", @"绿", @"向", @"映", @"含", @"曼", @"春", @"醉", @"之", @"新", @"雨", @"天", @"如", @"若", @"涵", @"亦", @"采", @"冬", @"安", @"芷", @"绮", @"雅", @"飞", @"又", @"寒", @"忆", @"晓", @"乐", @"笑", @"妙", @"元", @"碧", @"翠", @"初", @"怀", @"幻", @"慕", @"秋", @"语", @"觅", @"幼", @"灵", @"傲", @"冷", @"沛", @"念", @"寻", @"水", @"紫", @"易", @"惜", @"诗", @"青", @"雁", @"盼", @"尔", @"以", @"雪", @"夏", @"凝", @"丹", @"迎", @"问", @"宛", @"梦", @"怜", @"听", @"巧", @"凡", @"静", @"筱", @"幂", @"燕", @"梓", @"棱", @"入", @"泽", @"凡", @"菁", @"爽", @"湘", @"黛", @"玮", @"漪", @"陶", @"绛", @"跃", @"芜", @"慎", @"夕", @"熙", @"楠", @"韵", @"汾", @"斯", @"珏", @"沁", nil];
        woman1 = [[NSArray alloc] initWithObjects:@"烟", @"琴", @"蓝", @"梦", @"丹", @"柳", @"冬", @"萍", @"菱", @"寒", @"阳", @"霜", @"白", @"丝", @"南", @"真", @"露", @"云", @"芙", @"筠", @"容", @"香", @"荷", @"风", @"儿", @"雪", @"巧", @"蕾", @"芹", @"柔", @"灵", @"卉", @"夏", @"岚", @"蓉", @"萱", @"珍", @"彤", @"蕊", @"曼", @"凡", @"兰", @"晴", @"珊", @"易", @"青", @"春", @"玉", @"瑶", @"文", @"双", @"竹", @"凝", @"轩", @"菡", @"绿", @"枫", @"梅", @"璇", @"山", @"松", @"之", @"亦", @"蝶", @"莲", @"柏", @"波", @"安", @"天", @"薇", @"海", @"翠", @"槐", @"秋", @"雁", @"夜", @"晴", @"洵", @"馨", @"琪", @"鹭", @"羽", @"衣", @"醒", @"子", @"繁", @"垚", @"璐", @"盈", @"离", @"鸢", @"冉", @"薇", @"颜", @"媛", @"琦", @"琼", @"然", @"施", @"妗", @"乐", @"可", @"艺", nil];
    }
    
    return self;
}

-(NSString*) getRandomName:(BOOL)isMale
{
    NSString *surname = [surnameList objectAtIndex:(int)CCRANDOM_0_1() * surnameList.count];
    NSArray *name0 = nil;
    NSArray *name1 = nil;
    if(isMale)
    {
        name0 = man0;
        name1 = man1;
    }
    else
    {
        name0 = woman0;
        name1 = woman1;
    }
    
    NSString *n0 = [name0 objectAtIndex:CCRANDOM_0_1() * name0.count];
    NSString *n1 = [name1 objectAtIndex:CCRANDOM_0_1() * name1.count];
    
    NSString *fullname = [NSString stringWithFormat:@"%@%@%@",surname,n0,n1];
    
    return fullname;
}

@end
